{
  "format": "layers-model",
  "generatedBy": "keras v2.12.0",
  "convertedBy": "TensorFlow.js Converter v4.7.0",
  "modelTopology": {
    "keras_version": "2.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 128, 32, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "image"
            },
            "name": "image",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "Conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "HeNormal",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "Conv1",
            "inbound_nodes": [[["image", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "pool1",
            "inbound_nodes": [[["Conv1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "Conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "HeNormal",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "Conv2",
            "inbound_nodes": [[["pool1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "pool2",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "pool2",
            "inbound_nodes": [[["Conv2", 0, 0, {}]]]
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape",
              "trainable": true,
              "dtype": "float32",
              "target_shape": [32, 512]
            },
            "name": "reshape",
            "inbound_nodes": [[["pool2", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense1",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense1",
            "inbound_nodes": [[["reshape", 0, 0, {}]]]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_1",
            "inbound_nodes": [[["dense1", 0, 0, {}]]]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_2",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_2",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 128,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null },
                    "shared_object_id": 14
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null },
                    "shared_object_id": 15
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {},
                    "shared_object_id": 16
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.25,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            },
            "name": "bidirectional_2",
            "inbound_nodes": [[["dropout_1", 0, 0, {}]]]
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_3",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_3",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null },
                    "shared_object_id": 20
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null },
                    "shared_object_id": 21
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {},
                    "shared_object_id": 22
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.25,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            },
            "name": "bidirectional_3",
            "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense2",
              "trainable": true,
              "dtype": "float32",
              "units": 79,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense2",
            "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]
          }
        ],
        "input_layers": [["image", 0, 0]],
        "output_layers": [["dense2", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "Conv1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "Conv1/bias", "shape": [32], "dtype": "float32" },
        { "name": "Conv2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "Conv2/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/kernel",
          "shape": [64, 512],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/recurrent_kernel",
          "shape": [128, 512],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/kernel",
          "shape": [64, 512],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/recurrent_kernel",
          "shape": [128, 512],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/kernel",
          "shape": [256, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/recurrent_kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/kernel",
          "shape": [256, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/recurrent_kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/bias",
          "shape": [256],
          "dtype": "float32"
        },
        { "name": "dense1/kernel", "shape": [512, 64], "dtype": "float32" },
        { "name": "dense1/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense2/kernel", "shape": [128, 79], "dtype": "float32" },
        { "name": "dense2/bias", "shape": [79], "dtype": "float32" }
      ]
    }
  ]
}
